Autodesk.Revit.DB.Structure.StructuralConnectionHandlerType.SetInputPointsInfo(System.Collections.Generic.IList{Autodesk.Revit.DB.Structure.ConnectionInputPointInfo})
Sets the list of descption information used to select input points by some connections.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2017

Autodesk.Revit.DB.Structure.StructuralConnectionHandlerType.Create(Autodesk.Revit.DB.Document,System.String,System.Guid,System.String,Autodesk.Revit.DB.ElementId,System.Collections.Generic.IList{Autodesk.Revit.DB.Structure.ConnectionInputPointInfo})
Creates a new StructuralConnectionHandlerType object.
pADoc:
The document.
name:
The type name.
guid:
Connection GUID.
familyName:
Name of system family which created type will belong to.
categoryId:
Category identity of connection type.
inputPointsInfo:
List of description information used for the selection of input points.
Returns:
The newly created instance.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2017